<a href="https://colab.research.google.com/github/s1c5000/library_study/blob/main/finish_at_once/%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%B2%98%EB%A6%AC%EA%B8%B0%EC%B4%88_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 판다스 정리

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pd.Series([1,2,3,4, np.nan, 5]) # 기본이되는 Series

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
dtype: float64

## 날자형의 데이터 date_range

In [ ]:
date = pd.date_range('20180101', periods=6) # periods는 꼭 있어야한다

In [ ]:
date

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
type(date)

pandas.core.indexes.datetimes.DatetimeIndex

## DataFrame


> 값(value) + 인덱스(index) + 컬럼(columns) = 데이터프레임(DataFrame)     


> 값(value) + 인덱스(index) = 시리즈 클래스(Series)

In [ ]:
df = pd.DataFrame(np.random.randn(6,4)) # value값들만 넣으면 index와 columns는 지정되지 않는다
df

          0         1         2         3
0 -0.042633  1.744130 -0.229266 -0.216551
1 -1.360753 -1.008186 -0.018741 -0.090909
2  0.803470 -0.053459 -0.673693  0.900698
3  0.750023 -1.012746  1.020054  0.202362
4 -0.588694  0.638553  1.390178  0.859609
5 -0.788452 -0.188100 -0.164905  0.268663

In [ ]:
df = pd.DataFrame(np.random.randn(6,4), index=date, columns=['a','b','c','d'])
df

                   a         b         c         d
2018-01-01 -0.801892 -0.706821 -1.461377 -0.256161
2018-01-02  0.679159 -0.712063  0.086267 -0.502648
2018-01-03  1.346618  0.346594 -0.205615  0.912564
2018-01-04  1.530288 -1.334041  0.622367  1.618136
2018-01-05  0.334374 -0.645396 -0.929226  0.915046
2018-01-06  0.791898 -1.085919 -1.101869 -0.541617

In [ ]:
df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
df.values

array([[-0.8018918 , -0.70682149, -1.4613765 , -0.25616138],
       [ 0.67915885, -0.71206288,  0.08626651, -0.50264792],
       [ 1.34661763,  0.34659421, -0.20561523,  0.91256371],
       [ 1.53028808, -1.33404091,  0.62236688,  1.61813588],
       [ 0.33437438, -0.64539602, -0.92922597,  0.9150458 ],
       [ 0.7918977 , -1.08591901, -1.10186908, -0.54161665]])

### 데이터정렬

In [ ]:
df.sort_values(by='b', ascending=False)  # ascending = True로 하면 오름차순

                   a         b         c         d
2018-01-03  1.346618  0.346594 -0.205615  0.912564
2018-01-05  0.334374 -0.645396 -0.929226  0.915046
2018-01-01 -0.801892 -0.706821 -1.461377 -0.256161
2018-01-02  0.679159 -0.712063  0.086267 -0.502648
2018-01-06  0.791898 -1.085919 -1.101869 -0.541617
2018-01-04  1.530288 -1.334041  0.622367  1.618136

### 인덱싱

In [ ]:
df['a'] # 지정했던 columns 값으로 출력 (열)

2018-01-01   -0.801892
2018-01-02    0.679159
2018-01-03    1.346618
2018-01-04    1.530288
2018-01-05    0.334374
2018-01-06    0.791898
Freq: D, Name: a, dtype: float64

In [ ]:
df[1:3] # 인덱스 순서로 출력 (행)

                   a         b         c         d
2018-01-02  0.679159 -0.712063  0.086267 -0.502648
2018-01-03  1.346618  0.346594 -0.205615  0.912564

In [ ]:
df['20180102':'20180104'] # 인덱스 값으로 접근

                   a         b         c         d
2018-01-02  0.679159 -0.712063  0.086267 -0.502648
2018-01-03  1.346618  0.346594 -0.205615  0.912564
2018-01-04  1.530288 -1.334041  0.622367  1.618136

### loc로 인덱싱


> loc의 대괄호 안에 인덱스와 columns들을 [] 로 묶어서 넣으면 DataFrame으로 반환한다       
대괄호로 묶지않으면 Series형태로 반환

In [ ]:
type(df.loc['20180102']) # 하나의 값만 입력하면 열로접근, df.loc['20180102']로도 가능( pandas.core.series.Series형태로 출력)

pandas.core.series.Series

In [ ]:
df.loc[:,['a','b']] # ','로 행, 열 구분해서 접근한다

                   a         b
2018-01-01 -0.801892 -0.706821
2018-01-02  0.679159 -0.712063
2018-01-03  1.346618  0.346594
2018-01-04  1.530288 -1.334041
2018-01-05  0.334374 -0.645396
2018-01-06  0.791898 -1.085919

In [ ]:
df.loc['20180102': '20180104', ['a']]

                   a
2018-01-02  0.679159
2018-01-03  1.346618
2018-01-04  1.530288

In [ ]:
df.loc['20180103',['a']] # Series형태로 반환

a    1.346618
Name: 2018-01-03 00:00:00, dtype: float64

In [ ]:
df.loc[['20180103'],['a']] # DataFrame 형태로 반환

                   a
2018-01-03  1.346618

### iloc으로 인덱싱


> loc과 마찬가지로 안을 []로 묶으면 DataFrame으로 반환한다

In [ ]:
df.iloc[[3]]

                   a         b         c         d
2018-01-04  1.530288 -1.334041  0.622367  1.618136

In [ ]:
df.iloc[2:4,0:2] # 행과 열 모두를 넣을때 :과 []를 같이 넣으면 오류남

                   a         b
2018-01-03  1.346618  0.346594
2018-01-04  1.530288 -1.334041

In [ ]:
df.iloc[[1,3],[0,2,3]] # ,로 구분해서 가져올 수 있다

                   a         c         d
2018-01-02  0.679159  0.086267 -0.502648
2018-01-04  1.530288  0.622367  1.618136

In [ ]:
df.iloc[1:3,:]

                   a         b         c         d
2018-01-02  0.679159 -0.712063  0.086267 -0.502648
2018-01-03  1.346618  0.346594 -0.205615  0.912564

### 조건으로 가져오기

In [ ]:
df[df.a > 0]

                   a         b         c         d
2018-01-02  0.679159 -0.712063  0.086267 -0.502648
2018-01-03  1.346618  0.346594 -0.205615  0.912564
2018-01-04  1.530288 -1.334041  0.622367  1.618136
2018-01-05  0.334374 -0.645396 -0.929226  0.915046
2018-01-06  0.791898 -1.085919 -1.101869 -0.541617

In [ ]:
df[df > 0]

                   a         b         c         d
2018-01-01       NaN       NaN       NaN       NaN
2018-01-02  0.679159       NaN  0.086267       NaN
2018-01-03  1.346618  0.346594       NaN  0.912564
2018-01-04  1.530288       NaN  0.622367  1.618136
2018-01-05  0.334374       NaN       NaN  0.915046
2018-01-06  0.791898       NaN       NaN       NaN

In [ ]:
df.loc[(df['a'] > 0) & (df.b < 0)] # 연산자를 사용하려면 loc로 접근해야한다.

                   a         b         c         d
2018-01-02  0.679159 -0.712063  0.086267 -0.502648
2018-01-04  1.530288 -1.334041  0.622367  1.618136
2018-01-05  0.334374 -0.645396 -0.929226  0.915046
2018-01-06  0.791898 -1.085919 -1.101869 -0.541617

### DataFrame 복사

In [ ]:
df2 = df.copy() # copy()를 않하면 주소를 복사해서 같은걸 가르키게된다

In [ ]:
df2['e'] = ['one','one','two','three','four','five']
df2

                   a         b         c         d      e
2018-01-01 -0.801892 -0.706821 -1.461377 -0.256161    one
2018-01-02  0.679159 -0.712063  0.086267 -0.502648    one
2018-01-03  1.346618  0.346594 -0.205615  0.912564    two
2018-01-04  1.530288 -1.334041  0.622367  1.618136  three
2018-01-05  0.334374 -0.645396 -0.929226  0.915046   four
2018-01-06  0.791898 -1.085919 -1.101869 -0.541617   five

In [ ]:
df2['e'].isin(['two','tour']).to_frame() # isin()으로 in 조건을 걸 수 있다.(반환은 Series)

                e
2018-01-01  False
2018-01-02  False
2018-01-03   True
2018-01-04  False
2018-01-05  False
2018-01-06  False

In [ ]:
df[df2['e'].isin(['two','tour'])] # 위의 조건을 df안에 넣으면 조건으로도 사용 가능
# df는 'e'가 없지만 3번째 행이 True인 조건을 넣었기 때문에 3행을 출력했다. 인덱스도 맞아야함

                   a         b         c         d
2018-01-03  1.346618  0.346594 -0.205615  0.912564

In [ ]:
df3 = df2.copy()
df3.index = pd.date_range('20190101', periods=6) # 인덱스를 바꿈
#df3[df2['e'].isin(['two','tour'])] # 위의 셀과 같은 조건이지만 index가 맞지않아서 오류남

### apply


> list에 map이 있듯이 DataFrame에는 apply를 적용할 수 있다.

In [ ]:
df.apply(np.cumsum)

                   a         b         c         d
2018-01-01 -0.801892 -0.706821 -1.461377 -0.256161
2018-01-02 -0.122733 -1.418884 -1.375110 -0.758809
2018-01-03  1.223885 -1.072290 -1.580725  0.153754
2018-01-04  2.754173 -2.406331 -0.958358  1.771890
2018-01-05  3.088547 -3.051727 -1.887584  2.686936
2018-01-06  3.880445 -4.137646 -2.989453  2.145319

In [ ]:
print(df.apply(lambda x: x.max() - x.min(), axis=0)) # x는 비교할 행이나 열로 생각하면 된다
print(df.apply(lambda x: x.max() - x.min(), axis=1))

a    2.332180
b    1.680635
c    2.083743
d    2.159753
dtype: float64
2018-01-01    1.205215
2018-01-02    1.391222
2018-01-03    1.552233
2018-01-04    2.952177
2018-01-05    1.844272
2018-01-06    1.893767
Freq: D, dtype: float64

In [ ]:
df['f'] = df.apply(lambda x: x['c'] - x['d'] if (x['c'] > x['d']) else 0, axis=1) 
df

                   a         b         c         d         f
2018-01-01 -0.801892 -0.706821 -1.461377 -0.256161  0.000000
2018-01-02  0.679159 -0.712063  0.086267 -0.502648  0.588914
2018-01-03  1.346618  0.346594 -0.205615  0.912564  0.000000
2018-01-04  1.530288 -1.334041  0.622367  1.618136  0.000000
2018-01-05  0.334374 -0.645396 -0.929226  0.915046  0.000000
2018-01-06  0.791898 -1.085919 -1.101869 -0.541617  0.000000

## csv파일 작업

In [ ]:
housing = pd.read_csv('/content/sample_data/california_housing_train.csv')
housing

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

### sort

In [ ]:
housing.sort_values(by='median_income', ascending=False)[['median_income']]

       median_income
7879         15.0001
5048         15.0001
14697        15.0001
7268         15.0001
14791        15.0001
...              ...
10260         0.4999
10384         0.4999
4689          0.4999
11130         0.4999
16834         0.4999

[17000 rows x 1 columns]

### columns추가

In [ ]:
housing['room/bedrooms'] = housing['mtotal_rooms'] / housing['total_bedrooms']
housing

       longitude  latitude  ...  median_house_value  room/bedrooms
0        -114.31     34.19  ...             66900.0       4.374123
1        -114.47     34.40  ...             80100.0       4.024198
2        -114.56     33.69  ...             85700.0       4.137931
3        -114.57     33.64  ...             73400.0       4.454006
4        -114.57     33.57  ...             65500.0       4.460123
...          ...       ...  ...                 ...            ...
16995    -124.26     40.58  ...            111400.0       5.626904
16996    -124.27     40.69  ...             79000.0       4.448864
16997    -124.30     41.84  ...            103600.0       5.041431
16998    -124.30     41.80  ...             85800.0       4.840580
16999    -124.35     40.54  ...             94600.0       6.066667

[17000 rows x 10 columns]

### drop



> drop([index or column ])     
  columns를 넣으면 axis=1 지정해야한다.
  inplace = True 해줘야 반영

In [ ]:
housing2 = housing.copy()
housing2.drop(['latitude'], axis=1, inplace=True)
housing2

       longitude  housing_median_age  ...  median_house_value  room/bedrooms
0        -114.31                15.0  ...             66900.0       4.374123
1        -114.47                19.0  ...             80100.0       4.024198
2        -114.56                17.0  ...             85700.0       4.137931
3        -114.57                14.0  ...             73400.0       4.454006
4        -114.57                20.0  ...             65500.0       4.460123
...          ...                 ...  ...                 ...            ...
16995    -124.26                52.0  ...            111400.0       5.626904
16996    -124.27                36.0  ...             79000.0       4.448864
16997    -124.30                17.0  ...            103600.0       5.041431
16998    -124.30                19.0  ...             85800.0       4.840580
16999    -124.35                52.0  ...             94600.0       6.066667

[17000 rows x 9 columns]

In [ ]:
housing2.drop([0,2,3], inplace=True)

In [ ]:
housing2

       longitude  housing_median_age  ...  median_house_value  room/bedrooms
1        -114.47                19.0  ...             80100.0       4.024198
4        -114.57                20.0  ...             65500.0       4.460123
5        -114.58                29.0  ...             74000.0       5.877119
6        -114.58                25.0  ...             82400.0       4.275000
7        -114.59                41.0  ...             48500.0       4.833333
...          ...                 ...  ...                 ...            ...
16995    -124.26                52.0  ...            111400.0       5.626904
16996    -124.27                36.0  ...             79000.0       4.448864
16997    -124.30                17.0  ...            103600.0       5.041431
16998    -124.30                19.0  ...             85800.0       4.840580
16999    -124.35                52.0  ...             94600.0       6.066667

[16997 rows x 9 columns]

## concat

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [ ]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
result = pd.concat([df1,df2,df3], axis=1)
result

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [ ]:
result.columns

Index(['A', 'B', 'C', 'D', 'A', 'B', 'C', 'D', 'A', 'B', 'C', 'D'], dtype='object')

In [ ]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

result = pd.concat([df1, df4], axis=1)

In [ ]:
result = pd.concat([df1,df4], axis=1) # 인덱스 기준이기때문에 값이 없는곳은 NaN이 저장된다
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [ ]:
result = pd.concat([df1,df4], axis=1, join='inner') # 공통된 인덱스로 합치고 겹치치않는 부분은 버림, inner join
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [ ]:
result = pd.concat([df1,df4], axis=1).reindex(df1.index) # 기준을 정해서 합치기도 가능하다.
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [ ]:
result = pd.concat([df1,df4], ignore_index=True) # 두 데이터의 인덱스를 무시하고 합친 뒤 다시 인덱스 부여
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7